# terraform apply

```hcl
/le-tf-infra-aws-REF-ARCH/management/global/sso  

╰─❯ leverage tf apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group_membership.default["daniel.quiroga_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_group_membership.default["dorian.machado_datascientists"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64a89468-8051-70a4-c007-92ac6a2dba72"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_group_membership.default["gonzalo.gasperini_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_group_membership.default["julian.curetti_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_group_membership.default["manuel.quinteros_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_group_membership.default["nicolas.fressero_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_user.default["daniel.quiroga"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Daniel Quiroga"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "daniel.quiroga@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "daniel.quiroga@binbash.com.ar"
        }

      + name {
          + family_name = "Quiroga"
          + given_name  = "Daniel"
        }
    }

  # aws_identitystore_user.default["dorian.machado"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Dorian Machado"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "dorian.machado@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "dorian.machado@binbash.com.ar"
        }

      + name {
          + family_name = "Machado"
          + given_name  = "Dorian"
        }
    }

  # aws_identitystore_user.default["gonzalo.gasperini"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Gonzalo Gasperini"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "gonzalo.gasperini@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "gonzalo.gasperini@binbash.com.ar"
        }

      + name {
          + family_name = "Gasperini"
          + given_name  = "Gonzalo"
        }
    }

  # aws_identitystore_user.default["julian.curetti"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Julian Curetti"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "julian.curetti@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "julian.curetti@binbash.com.ar"
        }

      + name {
          + family_name = "Curetti"
          + given_name  = "Julian"
        }
    }

  # aws_identitystore_user.default["manuel.quinteros"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Manuel Quinteros"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "manuel.quinteros@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "manuel.quinteros@binbash.com.ar"
        }

      + name {
          + family_name = "Quinteros"
          + given_name  = "Manuel"
        }
    }

  # aws_identitystore_user.default["nicolas.fressero"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Nicolas Fressero"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "nicolas.fressero@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "nicolas.fressero@binbash.com.ar"
        }

      + name {
          + family_name = "Fressero"
          + given_name  = "Nicolas"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_identitystore_user.default["dorian.machado"]: Creating...
aws_identitystore_user.default["daniel.quiroga"]: Creating...
aws_identitystore_user.default["julian.curetti"]: Creating...
aws_identitystore_user.default["gonzalo.gasperini"]: Creating...
aws_identitystore_user.default["nicolas.fressero"]: Creating...
aws_identitystore_user.default["manuel.quinteros"]: Creating...
aws_identitystore_user.default["dorian.machado"]: Creation complete after 1s [id=d-906752b26f/7448e458-e071-70c9-04b5-6eae0ed9e945]
aws_identitystore_user.default["gonzalo.gasperini"]: Creation complete after 1s [id=d-906752b26f/74c8e418-3021-7046-4193-efbfff57952c]
aws_identitystore_user.default["julian.curetti"]: Creation complete after 1s [id=d-906752b26f/44c8f4e8-80f1-7091-a200-0f9ddad2661d]
aws_identitystore_user.default["nicolas.fressero"]: Creation complete after 1s [id=d-906752b26f/94087468-5021-70f8-1620-bfcfb9809a1e]
aws_identitystore_user.default["daniel.quiroga"]: Creation complete after 1s [id=d-906752b26f/84f81478-5091-7026-3f9d-3ea05262b28f]
aws_identitystore_user.default["manuel.quinteros"]: Creation complete after 1s [id=d-906752b26f/3498d4a8-7031-70b9-d290-43649b45b74e]
aws_identitystore_group_membership.default["daniel.quiroga_devops"]: Creating...
aws_identitystore_group_membership.default["nicolas.fressero_devops"]: Creating...
aws_identitystore_group_membership.default["manuel.quinteros_devops"]: Creating...
aws_identitystore_group_membership.default["julian.curetti_devops"]: Creating...
aws_identitystore_group_membership.default["gonzalo.gasperini_devops"]: Creating...
aws_identitystore_group_membership.default["dorian.machado_datascientists"]: Creating...
aws_identitystore_group_membership.default["julian.curetti_devops"]: Creation complete after 1s [id=d-906752b26f/e40804e8-5041-7064-e6c5-1197c252599b]
aws_identitystore_group_membership.default["dorian.machado_datascientists"]: Creation complete after 1s [id=d-906752b26f/1438a468-9041-7070-1144-23274e76189b]
aws_identitystore_group_membership.default["gonzalo.gasperini_devops"]: Creation complete after 1s [id=d-906752b26f/f4d8f4e8-c0b1-7027-50e8-6653cca19fa8]
aws_identitystore_group_membership.default["daniel.quiroga_devops"]: Creation complete after 1s [id=d-906752b26f/9488c4b8-40f1-70b7-b316-b7e2917a91cf]
aws_identitystore_group_membership.default["nicolas.fressero_devops"]: Creation complete after 1s [id=d-906752b26f/343854d8-e041-70cc-560f-c73a2853baa4]
aws_identitystore_group_membership.default["manuel.quinteros_devops"]: Creation complete after 1s [id=d-906752b26f/b4f8f478-1021-7095-8a12-cddefe268375]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
```